references/framework-history/2026-09-08/kv-quantization/sglang-fp4-mla-body.txt
## Summary
This PR introduces FP4 (E2M1) support for Multi-Head Latent Attention (MLA) KV cache in SGLang, enabling low-precision caching to reduce memory usage and improve inference efficiency. It integrates FP4 quantization utilities, Triton kernels, and unit tests while remaining backward compatible with FP16/FP8. See #10083, points 1-1, for more context.

Co-authored-by: @yicwang  Yichen Wang <yichen.wang@bytedance.com> 

## Usage
Added `--kv-cache-dtype=fp4_e2m1` option.
``` 
$ python3 -m sglang.launch_server --kv-cache-dtype fp4_e2m1 ... 
```

## Key Changes
1. **Server Argument Extension**
   - Added `--kv-cache-dtype=fp4_e2m1` option.

2. **FP4 Quantization Utility**
   - Added `KVFP4QuantizeUtil` with `batched_quantize` and `batched_dequantize` methods for block-wise (16) processing of [M, N, K] tensors.

3. **Core KV Cache Integration**
   - Updated `ModelRunner` and `MLATokenToKVPool` to support FP4 KV cache.
   - Added `kv_scale_buffer` for FP4 scaling.
   - Implemented Triton kernel `set_mla_kv_scale_buffer_kernel` for efficient nope+rope tensor handling.
   - Maintains backward compatibility with FP16/FP8 KV cache.

4. **Unit Test & Benchmark**
   - Tests validate FP4 correctness via MSE, MAE, PSNR, and Relative Error.
   - Benchmarks FP4 vs FP8 performance on GPU.

## Impact
- Enables low-precision FP4 KV cache for MLA.
- Reduces GPU memory usage while maintaining accuracy.
- Provides measurable speedup over FP8 quantization.
- Backward compatible with existing FP16/FP8 workflows.

## Accuracy Tests
The results show that on simpler datasets, the accuracy is nearly lossless compared to the baseline. On more challenging datasets, there is some accuracy degradation, but it remains within an acceptable range.
``` 
| Model | Dataset | Metric | Subset. | Num | Score | Cat.0 |


| DeepSeek-R1-0528-FP4-KV16 | gsm8k | mean_acc | main | 6595 | 0.9157 | default |
| DeepSeek-R1-0528-FP4-KV8_e4m3 | gsm8k | mean_acc | main | 6595 | 0.9154 | default |
| DeepSeek-R1-0528-FP4-KV4_fp4_e2m1 | gsm8k | mean_acc | main | 6595 | 0.9124 | default |

| DeepSeek-R1-0528-FP4-KV16 | aime25 | mean_acc | OVERALL | 150 | 0.5067 | - |
| DeepSeek-R1-0528-FP4-KV8_e4m3 | aime25 | mean_acc | OVERALL | 150 | 0.4934 | - |
| DeepSeek-R1-0528-FP4-KV4_fp4_e2m1 | aime25 | mean_acc | OVERALL | 150 | 0.4 | - |


| DeepSeek-R1-0528-FP4-KV16 | gpqa_diamond | mean_acc | default | 990 | 0.7707 | default |
| DeepSeek-R1-0528-FP4-KV8_e4m3 | gpqa_diamond | mean_acc | default | 990 | 0.7697 | default |
| DeepSeek-R1-0528-FP4-KV4_fp4_e2m1 | gpqa_diamond | mean_acc | default | 990 | 0.7273 | default |

```


## Performance Results
Tested on B200. Server is running with --model DeepSeek-R1-0528-FP4 --tp-size 4 --moe-runner-backend flashinfer_trtllm --disable-radix-cache. Client is running with with --goodput ttft:5000 tpot:50 --random-input-len 3500 --random-output-len 1500 --max-concurrency 50 and --num-prompts 100.

Baseline has the best performance as the trtllm kernel accepts the BF16 KVCache directly, so no dequantization overhead at all. 
```
(Default) BF16 KVCache

============ Serving Benchmark Result ============
Successful requests: 100
Benchmark duration (s): 116.44
Total input tokens: 349051
Total generated tokens: 150000
Request throughput (req/s): 0.86
Request goodput (req/s): 0.46
Output token throughput (tok/s): 1288.17
Total Token throughput (tok/s): 4285.73
---------------Time to First Token----------------
Mean TTFT (ms): 4853.44
Median TTFT (ms): 4784.58
P50 TTFT (ms): 4784.58
P90 TTFT (ms): 7828.38
P95 TTFT (ms): 9386.72
P99 TTFT (ms): 9616.72
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms): 35.05
Median TPOT (ms): 35.11
P50 TPOT (ms): 35.11
P90 TPOT (ms): 37.41
P95 TPOT (ms): 37.88
P99 TPOT (ms): 37.98
---------------Inter-token Latency----------------
Mean ITL (ms): 35.05
Median ITL (ms): 32.00
P50 ITL (ms): 32.00
P90 ITL (ms): 33.60
P95 ITL (ms): 33.91
P99 ITL (ms): 34.32
==================================================
```


When adding --kv-cache-dtype fp8_e4m3, the performance dropped significantly as KVCache is quanted at writing and dequanted at reading for attentions.
```
--kv-cache-dtype fp8_e4m3

============ Serving Benchmark Result ============
Successful requests: 100
Benchmark duration (s): 474.62
Total input tokens: 349051
Total generated tokens: 150000
Request throughput (req/s): 0.21
Request goodput (req/s): 0.00
Output token throughput (tok/s): 316.05
Total Token throughput (tok/s): 1051.48
---------------Time to First Token----------------
Mean TTFT (ms): 6093.23
Median TTFT (ms): 6057.21
P50 TTFT (ms): 6057.21
P90 TTFT (ms): 9279.85
P95 TTFT (ms): 10945.23
P99 TTFT (ms): 11347.56
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms): 153.69
Median TPOT (ms): 153.72
P50 TPOT (ms): 153.72
P90 TPOT (ms): 156.34
P95 TPOT (ms): 156.80
P99 TPOT (ms): 157.09
---------------Inter-token Latency----------------
Mean ITL (ms): 153.69
Median ITL (ms): 150.40
P50 ITL (ms): 150.40
P90 ITL (ms): 151.99
P95 ITL (ms): 152.28
P99 ITL (ms): 152.68
==================================================
```

With --kv-cache-dtype fp4_e2m1, the throughput is 17.8% higher compared to fp8_e4m3. Mostly due to quant/dequant to/from FP4 is faster than FP8.
```
--kv-cache-dtype fp4_e2m1

============ Serving Benchmark Result ============
Successful requests: 100
Benchmark duration (s): 402.92
Total input tokens: 349051
Total generated tokens: 150000
Request throughput (req/s): 0.25
Request goodput (req/s): 0.00
Output token throughput (tok/s): 372.28
Total Token throughput (tok/s): 1238.58
---------------Time to First Token----------------
Mean TTFT (ms): 5611.71
Median TTFT (ms): 5675.33
P50 TTFT (ms): 5675.33
P90 TTFT (ms): 9137.97
P95 TTFT (ms): 9952.08
P99 TTFT (ms): 10323.24
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms): 130.10
Median TPOT (ms): 129.87
P50 TPOT (ms): 129.87
P90 TPOT (ms): 133.07
P95 TPOT (ms): 133.56
P99 TPOT (ms): 133.66
---------------Inter-token Latency----------------
Mean ITL (ms): 130.10
Median ITL (ms): 126.83
P50 ITL (ms): 126.83
P90 ITL (ms): 128.53
P95 ITL (ms): 128.91
P99 ITL (ms): 129.45
==================================================
```

## Future Work
We plan to support Multi-Head Attention (MHA) next.


## Checklist

- [x] Format your code according to the [Format code with pre-commit](https://docs.sglang.ai/developer_guide/contribution_guide.html#format-code-with-pre-commit).
- [x] Add unit tests according to the [Run and add unit tests](https://docs.sglang.ai/developer_guide/contribution_guide.html#run-and-add-unit-tests).
- [x] Update documentation according to [Write documentations](https://docs.sglang.ai/developer_guide/contribution_guide.html#write-documentations).
- [x] Provide accuracy and speed benchmark results according to [Test the accuracy](https://docs.sglang.ai/developer_guide/contribution_guide.html#test-the-accuracy) and [Benchmark the speed](https://docs.sglang.ai/developer_guide/contribution_guide.html#benchmark-the-speed).